{
  "codes": {
    "ACDA": "Used when a creditor accepts the debit authorisation.",
    "ACNR": "The claim for non-receipt of a payment instruction is accepted.",
    "ACVA": "The claim for value date correction is accepted.",
    "BIAS": "Process a cancellation request but batch already settled.",
    "CHRG": "Further charges details are provided to resolve the case.",
    "CNCL": "Used when a requested cancellation is successful.",
    "CONF": "Used when a payment has been checked and was correctly executed without any intervention.",
    "CVAA": "The original value date was correct.",
    "CWFW": "Used when a payment will be cancelled to solve an investigation case.",
    "FTNA": "The cancellation request has been forwarded to the next agent for execution. Usage: This code should only be utilised where a Case Id is not present.",
    "ICOV": "Used when a transfer of funds has been initiated (a cover payment) to resolve a case.",
    "IDNE": "Process a Batch Cancellation \"using an incorrect batch sequence number”.",
    "IDUP": "Used when the requested check for a possible duplicate instruction is confirmed.",
    "INFO": "Used when additional information has been sent to the beneficiary of a payment.",
    "IPAY": "Used when the result of an investigation is, or will be, the initiation of a payment instruction.",
    "IPYI": "Used when a payment instruction (eg. MT103) has been initiated to resolve a case.",
    "IVCR": "Process a cancellation request with incorrect reference to original batch.",
    "MCOV": "Used when a transfer of funds has been modified (a cover payment) to resolve a case.",
    "MODI": "Used when a requested modification is successful.",
    "MWFW": "Used when the payment will be modified to solve an investigation case.",
    "NINF": "Used when no additional information is available.",
    "PDCR": "Used when a requested cancellation is pending.",
    "PDNG": "Used to inform that a response to an investigation is pending.",
    "PECR": "Used when a requested cancellation has been partially executed.",
    "PURP": "Further purpose details are provided to resolve the case.",
    "RJCR": "Used when a requested cancellation has been rejected.",
    "RJNR": "The claim for non-receipt of a payment instruction is rejected.",
    "RJVA": "The claim for value date correction is rejected.",
    "SMTC": "Used when the entry in the statement is correct.",
    "SMTI": "Used when the entry in the statement is incorrect and further information is provided with the resolution.",
    "UWFW": "Used when sender wants to respond to an assignment with an Unable To Apply workflow."
  },
  "description": "Specifies the result of an investigation, as published in an external investigation execution confirmation code set.",
  "name": "ExternalInvestigationExecutionConfirmation1Code"
}