{
  "codes": {
    "AC02": "Debtor account number invalid or missing.",
    "AC03": "Wrong account number in Credit Transfer.",
    "AGNT": "Agent in the payment workflow is incorrect.",
    "AM09": "Amount is not the amount agreed or expected.",
    "BE16": "Debtor or Ultimate Debtor identification code missing or invalid.",
    "BIAS": "Process a cancellation request but batch already settled.",
    "COVR": "Cover payments has either been returned or cancelled.",
    "CURR": "Currency of the payment is incorrect.",
    "CUST": "Cancellation requested by the Debtor.",
    "CUTA": "Cancellation requested because an investigation request has been received and no remediation is possible.",
    "DRTP": "Duplication of a request-to-pay message.",
    "DS24": "Cancellation requested because the original payment order expired due to time-out.",
    "DT01": "Invalid date (for example, wrong or missing settlement date).",
    "DUPL": "Payment is a duplicate of another payment.",
    "ECAG": "Payee (Creditor) cancels the Request To Pay (RTP) request due to error or adjustment agreement with Payer/Debtor.",
    "ENUE": "Cancellation or request for return requested by the Debtor specifically due to one or more errors by debtor in the original Credit Transfer. Usage: This code can be used for any error in the original Credit Transfer made by the Debtor. Can also be used if multiple errors were made in the original Credit Transfer.",
    "FRAD": "Cancellation requested following a transaction that was originated fraudulently. The use of the FraudulentOrigin code should be governed by jurisdictions.",
    "FRNA": "To complement a rejection response, suggesting the request for cancelation should be forwarded to the next agent in the payment transaction chain.",
    "FRTR": "Direct Debit Tracking recalled as Mandate Cancelled",
    "INCR": "Process a cancellation request with incorrect reference to original batch.",
    "INDM": "To express the wish to establish a bilateral indemnity agreement.",
    "MD06": "Return of funds requested by end customer.",
    "MODT": "The underlying transaction in relation to an RTP was modified.",
    "NARR": "Reason is provided as narrative information in the additional reason information.",
    "NFNA": "To complement a cancellation request, instructing the market infrastructure that the request for cancelation should not be forwarded to the next agent in the payment transaction chain.",
    "PAID": "The underlying transaction in relation to an RTP was already paid (via other means).",
    "PPRC": "Request to Pay cancellation initiated because the Payee is not in good standing.",
    "SVNR": "The payment is cancelled since a cash amount rendered was not correct or goods or a service was not rendered to the customer, e.g. in an e-commerce situation.",
    "SYAD": "Cancellation requested by System Member to Settlement System Administrator to indicate that the cancellation request must not be forwarded further in the chain.",
    "TECH": "Cancellation requested following technical problems resulting in an erroneous transaction.",
    "UAPA": "The Debtor is requesting a return of the payment because the payment was not properly authorized. Usage: This code can be used in the case where a Credit Transfer was made without proper authorization from the Debtor. This could be due to compromised end user credentials.",
    "UPAY": "Payment is not justified.",
    "WNTB": "Breach of warranty provided in connection with a request for payment."
  },
  "description": "Specifies the cancellation reason, as published in an external cancellation reason code set.",
  "name": "ExternalCancellationReason1Code"
}