{
  "codes": {
    "IN01": "Related transaction reference is incorrect.",
    "IN02": "Payment type service level is incorrect (former IncorrectBankOperationCode).",
    "IN03": "Payment type category purpose is incorrect (former IncorrectInstructionCode).",
    "IN04": "RequestedExecutionDate is incorrect.",
    "IN05": "Interbank settlement date is incorrect (former IncorrectValueDate).",
    "IN06": "Interbank settlement amount is incorrect (former IncorrectSettledAmount).",
    "IN07": "Debtor is incorrect.",
    "IN08": "DebtorAccount is incorrect.",
    "IN09": "InstructedReimbursementAgent is incorrect (former IncorrectReceiverCorrespondent).",
    "IN10": "ThirdReimbursementAgent is incorrect (former IncorrectThirdReimbursementInstitution).",
    "IN11": "Payment type clearing channel is incorrect (former PaymentScheme).",
    "IN12": "CreditorAgentAccount is incorrect (former IncorrectAccountOfBeneficiaryInstitution).",
    "IN13": "Creditor is incorrect.",
    "IN14": "Creditor account is incorrect.",
    "IN15": "RemittanceInformation is incorrect.",
    "IN16": "Transaction payment purpose is incorrect.",
    "IN17": "ChargeBearer is incorrect (former IncorrectDetailsOfCharges).",
    "IN18": "Instruction for next agent is incorrect (former IncorrectSenderToReceiverInformation).",
    "IN19": "Instruction for creditor agent is incorrect (former IncorrectInstructionForFinalAgent).",
    "IN33": "Amount in statement entry is incorrect.",
    "IN36": "SettlementAccount is incorrect.",
    "IN37": "Instructing reimbursement agent is incorrect.",
    "IN38": "Debtor's address is incorrect.",
    "IN39": "Creditor's address is incorrect.",
    "IN40": "RelatedRemittanceInformation is incorrect.",
    "MM20": "Name and account of creditor are not matching.",
    "MM21": "Name and account of debtor are not matching.",
    "MM22": "Name and account of creditor agent (former FinalAgent) are not matching.",
    "MM23": "Insufficient or incoherent details about the debtor with respect to regulatory requirements.",
    "MM24": "Insufficient or incoherent details about the creditor with respect to regulatory requirements.",
    "MM25": "Payment is pending execution. For reasons of regulatory requirements we request further information on the account number or unique identification of the debtor.",
    "MM26": "Payment is pending execution. For reasons of regulatory requirements we request further information on the name and/or address of the debtor.",
    "MM27": "Payment has been executed. For reasons of regulatory requirements we request further information on the account number or unique identification of the debtor.",
    "MM28": "Payment has been executed. For reasons of regulatory requirements we request further information on the name and/or address of the debtor.",
    "MM29": "Payment is pending execution. For reasons of regulatory requirements we request further information on the account number or unique identification of the creditor.",
    "MM30": "Payment is pending execution. For reasons of regulatory requirements we request further information on the name and/or address of the creditor.",
    "MM31": "Payment has been executed. For reasons of regulatory requirements we request further information on the account number or unique identification of the creditor.",
    "MM32": "Payment has been executed. For reasons of regulatory requirements we request further information on the name and/or address of the creditor.",
    "MM34": "Insufficient charges details provided.",
    "MM35": "Payment purpose needs to be further specified.",
    "NARR": "See narrative field for additional information."
  },
  "description": "Specifies the reason of an unable to apply due to incorrect data, as published in an external unable to apply incorrect data code set.",
  "name": "ExternalUnableToApplyIncorrectData1Code"
}