{
  "codes": {
    "04": "Transaction is related to a direct debit that is pre authorised (Abbuchungsauftrag).",
    "05": "Transaction is related to a direct debit that is not pre authorised (Einzugsermächtigung).",
    "08": "Transaction is related to a direct debit that is pre authorised (Avis de Prélèvement).",
    "19": "Transaction is related to a business-to-customer direct debit (CSB19).",
    "58": "Transaction is related to a business-to-business direct debit (CSB58).",
    "60": "LCR - Lettre de Change Relevé (Recovered Bill of Exchange) and BOR - Billet à Orde Relevé (Promissory Note)",
    "82": "Transaction is related to a direct debit that is not pre authorised (Einzugsermächtigung).",
    "83": "Transaction is related to a direct debit that is pre authorised (Abbuchungsauftrag).",
    "85": "Transaction is related to an urgent direct debit that is pre authorised (Avis de Prélèvement accéléré).",
    "89": "Transaction is related to an urgent direct debit that is pre authorised (Avis de Prélèvement vérifié).",
    "ACCEPT": "Transaction is related to payments via Acceptgiro owned by Currence.",
    "ADD": "Transaction is authenticated direct debit for domestic use.",
    "ARC": "Transaction is related to accounts receivable check.",
    "ASTI": "Indicates that the payment is sent by an authorized third party on behalf of the participant.",
    "B2B": "Transaction is related to SEPA business to business direct debit.",
    "B2BAMIPM": "SEPA B2B Direct Debit AMI based on a paper mandate",
    "BACP": "Indicates that the payment was initiated manually using a GUI (Graphical User Interface).",
    "BPA": "Transaction is related to an Instant Credit Transfer under the rules of the Centrale Bank van Aruba, based on the EPC SCT Inst scheme, with a specific batch time-out delay.",
    "BSE": "Transaction is related to the German Paperless Cheque Collection procedure “Belegloser Scheckeinzug - BSE”",
    "CARD": "Transaction is related to card clearing.",
    "CCD": "Transaction is related to cash concentration or disbursement corporate counterparty.",
    "CCI": "Transaction is related to an intra-group bank initiated cash management payment",
    "CHN": "Transaction is related to truncated checks. Conversion of physical instrument to electonric form for transmission to the paying bank and where the original paper document does not continue in the clearing process..The original instrument rules are retained throughout the life of the instrument.",
    "CIE": "A credit entry initiated by or on behalf of the holder of a consumer account",
    "CLSCCPERX": "Transaction is related to the CLSClearedFX service for Eurex. Usage: The code is mandatory for all pacs.009 payments to this service.",
    "CLSCCPLCH": "Transaction is related to the CLSClearedFX service for London Exchange Clearing House. Usage: The code is mandatory for all pacs.009 payments to this service.",
    "COR1": "Optional shorter time cycle (D-1) for SEPA Core Direct Debit",
    "CORAMIPM": "SEPA Core Direct Debit AMI based on a paper mandate",
    "CORE": "Transaction is related to SEPA direct debit -core.",
    "CPP": "Transaction is related to cash per post. Transaction to ultimate recipient having no bank account. Primary beneficiary is a postal service provider. Funds are paid out by cash. Additional necessary information for address and delivery options need to be attached.",
    "CR1AMIPM": "Optional shorter time cycle (D-1) for SEPA Core Direct Debit AMI based on a paper mandate",
    "CTP": "Payment via Credit Transfer but Instant Credit Transfer is also possible.",
    "CTX": "Transaction is related to corporate trade exchange.",
    "DDFA": "SEPA Fixed Amount Direct Debit",
    "DDMC": "Transaction is related to a direct debit instruction authorized under a confirmed electronic mandate.",
    "DDMP": "Transaction is related to a direct debit instruction authorized under a paper based mandate, supported by paper authorization signed by the debtor.",
    "DDMU": "Transaction is related to a direct debit instruction authorized under an unconfirmed electronic mandate requiring confirmation by the debtor.",
    "DDNR": "SEPA Core Direct Debit with ‘no refund’ option",
    "DDT": "Transaction is related to direct debits.",
    "FADAMIPM": "SEPA Fixed Amount Direct Debit AMI based on a paper mandate",
    "FDP": "Type of Payment used within the New Payments Architecture (UK). Forward-dated payments are one-off payments sent and received on a pre-arranged date, set-up by the customer in advance, for example, to pay a bill.",
    "GST": "Transaction is related to truncated credit transfers. Conversion of physical instrument to electonric form for transmission to the paying bank and where the original paper document does not continue in the clearing process..The original instrument rules are retained throughout the life of the instrument. Transaction triggered by specific marked and populated paper slip. Reconciliation reference is secured by check digits supporting secure optical recognition. All other remittance information is truncated prior transmission.",
    "IAT": "Transaction is related to international ACH.",
    "ICMC": "Transaction is related to an Incident Management Correction procedure based on the DD infrastructure.",
    "IDEAL": "Transaction is related to payments via internet owned by Currence.",
    "IMD": "Type of Payment used within the New Payments Architecture (UK). Immediate Payments are used for payments initiated by customers using channels such as internet, mobile or telephone banking, where the customer wants the payment to be effected immediately.",
    "IN": "Transaction is related to cross border customer credit transfer.",
    "INST": "Transaction is related to an Instant Credit Transfer. Use case example: SEPA Instant Credit Transfer (SCT Inst)",
    "INSTIDEAL": "Transaction is related to payments via internet owned by Currence which uses an Instant Credit Transfer.",
    "INSTNT01": "The transaction is related to a regular Credit Transfer and will be instantly processed under the Dutch AOS on top of the EPC SCT scheme.",
    "INSTNT01IDEAL": "Transaction is related to payments via internet owned by Currence which uses a regular Credit Transfer and will be instantly processed under the Dutch AOS on top of the EPC SCT scheme.",
    "INSTTC01": "The transaction is related to an Instant Credit Transfer under the rules of the Dutch AOS on top of the EPC SCT Inst scheme.",
    "INSTTC01IDEAL": "Transaction is related to payments via internet owned by Currence which uses an Instant Credit Transfer under the rules of the Dutch AOS on top of the EPC SCT Inst scheme.",
    "IPA": "Transaction is related to an Instant Credit Transfer under the rules of the Centrale Bank van Aruba, based on the EPC SCT Inst scheme.",
    "ISE": "Transaction is related to the German Image-based Cheque Collection Procedure “Imagegestützter Scheckeinzug - ISE”",
    "ITP": "Payment via Instant Credit Transfer but Credit Transfer is also possible.",
    "MANP": "Indicates that the payment is sent by responsible Central Bank on behalf of the participant in case of contingency.",
    "MDP": "Type of New Payments Architecture (NPA) payment. Payments are processed over a three-day cycle and available to customers early in the morning of Day 3.",
    "NLDO": "Transaction is related to a Domestic payment initiated by PAIN.001",
    "NLGOV": "Transaction is related to direct debit scheme owned by the NVB.",
    "NLUP": "Transaction is related to a Domestic payment initiated by PAIN.001",
    "ONCL": "Transaction is related to overnight clearing.",
    "PERI": "Credit transfer contains Extended Remittance Information (ERI) as defined within the applicable scheme.",
    "POP": "Transaction is related to point-of-purchase.",
    "POS": "Transaction is related to point-of-sale.",
    "PPD": "Transaction is related to prearranged payment or deposit consumer counterparty.",
    "RCK": "Transaction is related to re-presented check entry.",
    "RDD": "Transaction is related to returned direct debits.",
    "RIBA": "Transaction is related to a non-pre authorised collection (RIBA).",
    "RIDO": "Transaction is related to a direct debit that is pre authorised and revocable (RID Ordinario).",
    "RIDV": "Transaction is related to an urgent direct debit that is pre authorised and revocable (RID Veloce).",
    "RTR": "Transaction is related to returned credit transfers.",
    "SBTI": "Indicates that the payment is submitted to move liquidity to the technical account - dedicated to real-time settlement in an external system (for example ancillary system) . The payment is processed in a separate payment queue besides the normal processing.",
    "SCN": "Transaction is related to revoked truncated checks.",
    "SDCL": "Transaction is related to New Zealand High Value Clearing System (HVCS) same day clearing payments.",
    "SDD": "Transaction is related to revoked direct debits.",
    "SDN": "Transaction is related to payments via a ‘Standaard Digitale Nota’ InvoiceAcceptgiro payment.",
    "SGT": "Transaction is related to revoked truncated credit transfers.",
    "SOP": "Standing Orders are regular payments of a fixed amount paid to the same recipient on a specified date, for example, to pay rent.",
    "SRD": "Transaction is related to revoked returned direct debits.",
    "SRT": "Transaction is related to revoked returned credit transfers",
    "STR": "Transaction is related to revoked credit transfers",
    "TEL": "Transaction is related to telephone initiated entry.",
    "TRF": "Transaction is related to credit transfers",
    "UDD": "Transaction is unauthenticated direct debit for domestic use.",
    "WEB": "Transaction is related to internet initiated entry."
  },
  "description": "Specifies the external local instrument code in the format of character string with a maximum length of 35 characters.",
  "name": "ExternalLocalInstrument1Code"
}