{
  "codes": {
    "AROI": "Document is a payment that applies to a specific source document.",
    "BOLD": "Document is a shipping notice.",
    "CINV": "Document is an invoice.",
    "CMCN": "Document is an agreement between the parties, stipulating the terms and conditions of the delivery of goods or services.",
    "CNFA": "Document is a credit note for the final amount settled for a commercial transaction.",
    "CONT": "Document is a contract evidencing an agreement between the seller and buyer for the supply of goods and/or services.",
    "CREN": "Document is a credit note.",
    "DEBN": "Document is a debit note.",
    "DISP": "Document is an advice of dispatch of the goods.",
    "DNFA": "Document is a debit note for the final amount settled for a commercial transaction.",
    "HIRI": "Document is an invoice for the hiring of human resources or renting goods or equipment.",
    "INVS": "Document is a signed invoice.",
    "MSIN": "Document is an invoice claiming payment for the supply of metered services, eg. Gas or electricity, supplied to a fixed meter.",
    "PROF": "In trade transactions, a pro forma invoice is a document that states a commitment from the seller to sell goods to the buyer at specified prices and terms. It is used to declare the value of the trade. It is not a true invoice, because it is not used to record accounts receivable for the seller and accounts payable for the buyer.",
    "PUOR": "Document is a purchase order.",
    "QUOT": "Document is a quotation setting out the conditions under which the goods and/or services are offered.",
    "SBIN": "Document is a statement of the transactions posted to the debtor's account at the supplier.",
    "SOAC": "Document is a statement of the transactions posted to the debtor's account at the supplier.",
    "SPRR": "Document is a document presented by the seller in support of the procurement of goods and/or services.",
    "TISH": "Document is a timesheet recording times for the provision of services and/or delivery of goods.",
    "TSUT": "Document is a transaction identifier as assigned by the Trade Services Utility.",
    "USAR": "Document is a usage report indicating the consumption pattern for designated goods and/or services.",
    "VCHR": "Document is an electronic payment document."
  },
  "description": "Specifies the document type as published in an external document type code list.",
  "name": "ExternalDocumentType1Code"
}