{
  "codes": {
    "ACCY": "Number of monetary units specified in a currency, where the unit of currency is explicit and compliant with ISO 4217.",
    "ACRE": "Unit of measure equal to 4, 840 square yards.",
    "ALOW": "Amount of money deducted from a price or an amount due.",
    "ARES": "Unit of measure equal to a 100 square meters.",
    "BAGG": "Code for a bag.",
    "BALE": "Code for a bale.",
    "BARL": "Unit of volume that is equal to 42 US gallons.",
    "BCUF": "Unit of measure for large volumes of natural gas equivalent to 28316846 cubic meters.",
    "BDFT": "Measure of length equal to 144 cubic inches.",
    "BOTL": "Code for a bottle.",
    "BOXX": "Code for a box.",
    "BRTU": "Unit of measure of heat required to raise the temperature of one pound of water by one degree Fahrenheit.",
    "BUSL": "Unit of weight that is equal to 8 gallons. Mostly used for agricultural products with a specification of weight defined for each commodity differently.",
    "CBIN": "Measure of a volume, one inch by one inch by one inch.",
    "CBME": "Unit of volume that is equal to one meter in length, breadth and height or also equal to 1000 liters.",
    "CBML": "Unit of volume that is equal to one thousandth of a litre.",
    "CDDA": "Cooling degree day",
    "CEER": "Unit of emissions type (or carbon credits) issued by the Clean Development Mechanism (CDM) Executive Board for emission reductions achieved by CDM projects and verified by a DOE (Designated Operational Entity) under the rules of the Kyoto Protocol.",
    "CELI": "Unit of volume that is equal to one hundredth of a litre.",
    "CLRT": "Unit of offset credits used by the Climate Action Reserve. One Climate Reserve Tonne is equal to one metric ton of Greenhouse Gas (GHG) reduced/sequestered.",
    "CMET": "Unit of measure that is equal to one hundredth of a metre.",
    "CNTR": "Code for a container.",
    "CPDA": "Critical precipitation day",
    "CRAT": "Code for a crate.",
    "CRTN": "Code for a carton.",
    "DAYS": "Unit of time that is equal to 24 hours.",
    "DGEU": "Amount of fuel alternative equal to one gallon of diesel.",
    "DMET": "Unit of weight that is equal to the same mass value as a metric ton excluding moisture.",
    "ENVC": "Unit of measure for ownership of credit (or allowance) of carbon dioxide emission (in metric ton).",
    "ENVO": "Unit of measure for reduction of carbon dioxide emission (in metric ton) that may result in Environmental Credit.",
    "FOOT": "Unit of length equal to 1/3 yard.",
    "FUTU": "Exchange traded contract that defines an agreement to buy specific quantities of a commodity or financial instrument at an agreed time in the future.",
    "GBFO": "Unit of volume equal to 2, 841 306 centilitre.",
    "GBGA": "Unit of volume that is equal to 8 pints.",
    "GBOU": "Unit of weight equal to a sixteenth of a pound.",
    "GBPI": "Unit of volume that is equal to 568 cubic centimetres.",
    "GBQA": "Unit of volume that is equal to 2 pints.",
    "GBTN": "Measure of weight, in Britain 2240 lb (long ton).",
    "GGEU": "Amount of fuel alternative equal to one gallon of gasoline.",
    "GGJL": "Unit of energy equal to 1,000,000,000 joules (J).",
    "GRAM": "Unit of measure that is equal to a 1, 000th of a kilo.",
    "GWHO": "Unit of measure that is equal to the power consumption of one Gigawatt during one hour.",
    "HDDA": "Heating degree day",
    "HECT": "Unit of measure that is equal to 10, 000 square meters.",
    "HUWG": "Unit of weight or mass of various values in the Imperial Unit System also known as quintal, cental or centum.",
    "INCH": "Measure of length equal to 2.54 cm.",
    "IPNT": "Decimal number used to calculate an amount or a price.",
    "JOUL": "Unit of energy defined as amount of work done when a force of one newton displaces a mass through a distance of one meter in the direction of that force.",
    "KILO": "Basic unit of mass in the SI system, 1000 grams.",
    "KMET": "Unit of measure that is equal to 1, 000 meters.",
    "KMOC": "Unit of measure of the capacity of production of electric power equal to 1000 watt in one minute.",
    "KWDC": "Unit of measure of the capacity of production of electric power equal to 1000 watt in one day.",
    "KWHC": "Unit of measure of the capacity of production of electric power equal to 1000 watt in one hour.",
    "KWHO": "Unit of measure that is equal to the power consumption of one kilowatt during one hour.",
    "KWMC": "Unit of measure of the capacity of production of electric power equal to 1000 watt in one month.",
    "KWYC": "Unit of measure of the capacity of production of electric power equal to 1000 watt in one year.",
    "LITR": "Unit of volume that is equal to a thousand cubic centimetres.",
    "LOTS": "Indication of the unit of measurement.",
    "MBTU": "Unit of measure of heat equal to one million British thermal unit (BTU).",
    "METR": "Unit of length in the metric system, equal to 39.37 inches.",
    "MIBA": "Unit of volume that is equal to 1 million barrels equivalent to 42.000.000 US gallons.",
    "MILE": "Unit of length equal to 1, 760 yards.",
    "MILI": "Unit of volume that is equal to one thousandth of a litre.",
    "MMET": "Unit of measure that is a thousandth of one metre.",
    "MMOC": "Unit of measure of the capacity of production of electric power equal to 1000000 watt in one month.",
    "MWDC": "Unit of measure of the capacity of production of electric power equal to 1000000 watt in one day.",
    "MWHC": "Unit of measure of the capacity of production of electric power equal to 1000000 watt in one hour.",
    "MWHO": "Unit of measure that is equal to the power consumption of one megawatt during one hour.",
    "MWMC": "Unit of measure of the capacity of production of electric power equal to 1000000 watt in one minute.",
    "MWYC": "Unit of measure of the capacity of production of electric power equal to 1000000 watt in one year.",
    "OZTR": "Unit of weight equal to 31.1034768 grams. Used in precious metals.",
    "PIEC": "Standard length of cloth, wallpaper, as an item for sale or amount of a substance.",
    "PUND": "Unit of weight equal to 0.454 kilograms.",
    "PWRD": "Amount of money borrowed, or part of that amount which remains unpaid (excluding interest).",
    "SCMT": "Measure of a surface, one centimetre by one centimetre.",
    "SHAS": "Financial instrument that gives the owner right to dividends paid by a company and the most junior claim on the companies assets in the event of a bankruptcy.",
    "SMET": "Measure of a surface, one metre by one metre.",
    "SMIL": "Measure of a surface, one millimetre by one millimetre.",
    "SQFO": "Measure of a surface, one foot by one foot.",
    "SQIN": "Measure of a surface, one inch by one inch.",
    "SQKI": "Measure of a surface, one kilometre by one kilometre.",
    "SQMI": "Measure of a surface, one mile by one mile.",
    "SQYA": "Measure of a surface, one yard by one yard.",
    "THMS": "Unit of heat, often used a unit of measure for natural gas in the UK.",
    "TOCD": "Tons of carbon dioxide.",
    "TONE": "Unit of mass equal to 1000 kilograms; equivalent to approximately 2,204.6 pounds, 1.102 short tons (US) or 0.984 long tons (imperial).",
    "TONS": "Measure of weight, in Britain 2240lb (long ton)and in the US 2000lb (short ton).",
    "UCWT": "Unit of weight or mass of various values in the US Customary System also known as quintal, cental or centum. Equal to 100 lbs.",
    "USBA": "Unit of volume equal to 158, 9873 litre.",
    "USFO": "Unit of volume equal to 2, 957353 centilitre.",
    "USGA": "Unit of volume that is equal to 8 pints.",
    "USOU": "Unit of weight equal to a sixteenth of a pound.",
    "USPI": "Unit of volume that is equal to 473 cubic centimetres.",
    "USQA": "Unit of volume that is equal to 2 pints.",
    "USTN": "Measure of weight, in the US 2000 lb (short ton).",
    "YARD": "Unit of length equal to 3 feet or 0.9144 metre."
  },
  "description": "Specifies the external unit of measure by means of a code in the format of character string with a maximum length of 4 characters.",
  "name": "ExternalUnitOfMeasure1Code"
}