{
  "codes": {
    "UM01": "Related transaction reference cannot be modified.",
    "UM02": "Service level element of payment type cannot be modified(former UnableToModifyBankOperationCode).",
    "UM03": "Category purpose element of payment type cannot be modified (former UnableToModifyInstructionCode).",
    "UM04": "RequestedExecutionDate cannot be modified.",
    "UM05": "InterbankSettlementDate cannot be modified (former UnableToModifyValueDate).",
    "UM06": "SettlementAccount cannot be modified (former UnableToModifyInterbankSettlementAccount).",
    "UM07": "Debtor cannot be modified.",
    "UM08": "DebtorAccount cannot be modified.",
    "UM09": "InstructedReimbursementAgent cannot be modified (former UnableToModifyReceiverCorrespondent).",
    "UM10": "ThirdReimbursementAgent cannot be modified (former UnableToModifyThirdReimbursementInstitution).",
    "UM11": "Clearing Channel element of payment type cannot be modified (former UnableToModifyPaymentScheme)",
    "UM12": "Creditor agent account cannot be modified (former UnableToModifyAccountOfBeneficiaryInstitution)",
    "UM13": "Creditor cannot be modified.",
    "UM14": "Creditor account cannot be modified.",
    "UM15": "Remittance information cannot be modified.",
    "UM16": "PaymentPurpose cannot be modified.",
    "UM17": "Charge bearer cannot be modified (former UnableToModifyDetailsOfCharges).",
    "UM18": "Instruction for next agent cannot be modified (former UnableToModifySenderToReceiver).",
    "UM19": "Instruction for creditor agent cannot be modified. (former UnableToModifyInstructionForFinalAgent).",
    "UM20": "Used to inform of cancellation and request a new payment instruction. This should only be used if an agent does not want to modify a pending payment.",
    "UM21": "Modification is not possible and the cancellation is requested.",
    "UM22": "Debtor agent account cannot be modified (applicable for direct debits).",
    "UM23": "Interbank settlement amount cannot be modified.",
    "UM24": "Instruction for debtor agent cannot be modified (applicable for direct debits)",
    "UM25": "Requested collection date cannot be modified (applicable for direct debits)",
    "UM26": "Payment type cannot be modified.",
    "UM27": "Instructed or equivalent amount cannot be modified.",
    "UM28": "Priority of payment message cannot be modified."
  },
  "description": "Specifies the reason for the rejection of a modification, as published in an external payment modification rejection code set.",
  "name": "ExternalPaymentModificationRejection1Code"
}