{
  "codes": {
    "AC01": "Format of the account number specified is not correct",
    "AC04": "Account number specified has been closed on the Receiver's books",
    "AC06": "Account specified is blocked, prohibiting posting of transactions against it.",
    "AG01": "Transaction forbidden on this type of account (formerly NoAgreement)",
    "AG02": "Bank Operation code specified in the message is not valid for receiver",
    "AM02": "Specific transaction/message amount is greater than allowed maximum",
    "AM03": "Specified message amount is a non processable currency outside of existing agreement",
    "AM05": "Duplication",
    "BE01": "Identification of end customer is not consistent with associated account number. (formerly CreditorConsistency).",
    "BE04": "Specification of creditor's address, which is required for payment, is missing/not correct (formerly IncorrectCreditorAddress).",
    "BE05": "Party who initiated the message is not recognised by the end customer",
    "BE06": "End customer specified is not known at associated Sort/National Bank Code or does no longer exist in the books",
    "BE07": "Specification of debtor's address, which is required for payment, is missing/not correct.",
    "DT01": "Invalid date (eg, wrong settlement date)",
    "FF01": "File format incomplete or invalid",
    "MD01": "No Mandate",
    "MD02": "Mandate related information data required by the scheme is missing.",
    "MD07": "End customer is deceased.",
    "MD08": "Receiving agent does not offer specified Mandate services",
    "MD09": "Account is not open to specified Mandates services",
    "MD10": "Account is not open to specified Mandates services for this particular creditor",
    "MD11": "Agent to whom the message needs to be forwarded cannot be located",
    "MD12": "Mandate identification is not unique to the creditor",
    "MD13": "There is a problem with the customer authentication",
    "MD14": "Agent in the payment workflow is incorrect",
    "MD15": "Currency of the transaction is incorrect",
    "MD16": "Cancellation/amendment requested by the debtor",
    "MD17": "Cancellation/amendment requested by the creditor",
    "MD18": "Cancellation/amendment requested by the creditor and the debtor",
    "MD19": "Mandate cancellation following early reimbursement of the debit by the debtor",
    "MD20": "Mandate cancellation following validity expiration",
    "MD21": "Mandate cancellation due to suspected fraud",
    "MD22": "Mandate cancellation following mandate initiation cancellation",
    "MD23": "Mandate cancellation following mandate amendment cancellation",
    "MS02": "Reason has not been specified by end customer",
    "MS03": "Reason has not been specified by agent.",
    "NARR": "Reason is provided as narrative information in the additional reason information.",
    "RC01": "Bank Identifier code specified in the message has an incorrect format (formerly IncorrectFormatForRoutingCode).",
    "RF01": "Transaction reference is not unique within the message.",
    "RR01": "Specification of the debtor’s account or unique identification needed for reasons of regulatory requirements is insufficient or missing",
    "RR02": "Specification of the debtor’s name and/or address needed for regulatory requirements is insufficient or missing.",
    "RR03": "Specification of the creditor’s name and/or address needed for regulatory requirements is insufficient or missing.",
    "RR04": "Regulatory Reason",
    "SL01": "Due to specific service offered by the Debtor Agent",
    "SL11": "Whitelisting service offered by the Debtor Agent; Debtor has not included the Creditor on its “Whitelist” (yet). In the Whitelist the Debtor may list all allowed Creditors to debit Debtor bank account.",
    "SL12": "Blacklisting service offered by the Debtor Agent; Debtor included the Creditor on his “Blacklist”. In the Blacklist the Debtor may list all Creditors not allowed to debit Debtor bank account.",
    "SL13": "Due to Maximum allowed Direct Debit Transactions per period service offered by the Debtor Agent.",
    "SL14": "Due to Maximum allowed Direct Debit Transaction amount service offered by the Debtor Agent."
  },
  "description": "Specifies the external mandate processing reason code in the format of character string with a maximum length of 4 characters.",
  "name": "ExternalMandateReason1Code"
}